Revit 2024 API
NavisworksExportOptions Constructor
 Create an instance of Navisworks Export Options set with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public NavisworksExportOptions()
Visual Basic
Public Sub New
Visual C++
public:
NavisworksExportOptions()
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace